
ctl-opt ACTGRP(*STGMDL);
ctl-opt ALLOC(*STGMDL);
ctl-opt ALTSEQ(*NONE);
ctl-opt ALWNULL(*NO);
ctl-opt AUT(*LIBRCRTAUT);
ctl-opt BNDDIR('binding-directory-name':'binding-directory-name');
ctl-opt CCSID(123);
ctl-opt CCSIDCVT(*EXCP);
ctl-opt CHARCOUNT(*NATURAL);
ctl-opt CHARCOUNTTYPES(*UTF8);
ctl-opt COPYNEST(123);
ctl-opt COPYRIGHT('copyright string');
ctl-opt CURSYM('sym');
ctl-opt CVTOPT(*NODATETIME:*GRAPHIC:*VARCHAR:*VARGRAPHIC);
ctl-opt DATEDIT(fmt{separator});
ctl-opt DATEYY(*ALLOW | *WARN | *NOALLOW);
ctl-opt DATFMT(*MDY&);
ctl-opt DCLOPT(*NOCHGDSLEN);
ctl-opt DEBUG(*DUMP);
ctl-opt DECEDIT(*JOBRUN);
ctl-opt DECPREC(30);
ctl-opt DFTACTGRP(*YES);
ctl-opt DFTNAME(rpg_name);
ctl-opt ENBPFRCOL(*PEP);
ctl-opt EXPROPTS(*MAXDIGITS);
ctl-opt EXTBININT(*NO);
ctl-opt EXTBININT;
ctl-opt FIXNBR(*ZONED);
ctl-opt FLTDIV(*NO);
ctl-opt FORMSALIGN(*NO);
ctl-opt FTRANS(*NONE);
ctl-opt GENLVL(123);
ctl-opt INDENT(*NONE);
ctl-opt INTPREC(10);
ctl-opt LANGID(*JOBRUN);
ctl-opt MAIN(main_procedure_name);
ctl-opt NOMAIN;
ctl-opt OPENOPT (*NOINZOFL:*NOCVTDATA);
ctl-opt OPTIMIZE(*NONE);
ctl-opt OPTION(*NOXREF:*NOGEN:*NOSECLVL:*SHOWCPY:*NOEXPDDS:*NOEXT:*NOSHOWSKP :*NOSRCSTMT:*NODEBUGIO:*NOUNREF);
ctl-opt PGMINFO(*PCML);
ctl-opt PRFDTA(*NOCOL);
ctl-opt REQPREXP(*NO);
ctl-opt SRTSEQ(*HEX);
ctl-opt STGMDL(*INHERIT);
ctl-opt TEXT(*SRCMBRTXT);
ctl-opt THREAD(*CONCURRENT);
ctl-opt TIMFMT(*ISO:);
ctl-opt TIMFMT(*ISO.);
ctl-opt TRUNCNBR(*YES);
ctl-opt USRPRF(*USER);
ctl-opt VALIDATE(*NODATETIME);
