//dcl-ds vs qualified;
	//s1 char(3) inz('  ');
	//*n char(3) inz(SP0);
	//*n char(3) inZ(SP1);
	//*n char(3) inZ(SP2);
	//*n char(3) inZ(SP3);
	//validSpaces char(3) dim(5) samepos(s1);
//end-ds;
//
//if (%trim(ctlValues(2)) in vs.validSpaces);
//
*inlr = *on;
