dcl-f MTNCUSTD workstn infds(dfInfDS) indds(dfIndDS) usropn;
dcl-f PMTCUSTD workstn infds(dfInfDS) indds(dfIndDS) sfile(SFL:SflRRN);
dcl-f PMTSTATED workstn infds(dfInfDS) indds(dfIndDS) sfile(SFL:SflRRN);
dcl-f GETOBJUP usage(*output) usropn block(*yes);
dcl-f   BTID    WORKSTN     INFDS(dfInfDS) Usropn;
dcl-f   MYPRT printer(133) oflind(*in99);
dcl-f   QPRINT printer(132) oflind(*in99) prtctl(pCtl);
dcl-f   QCUSTCDT Disk extfile('QIWS/QCUSTCDT');
dcl-f   QPRINT printer(132);
dcl-f   QPRINT printer(132) oflind(*in99);
dcl-f   QPRINT printer(132) oflind(*in99) prtctl(pCtl);
dcl-f MYPRT printer(133)  usropn oflind(*in99) extfile('MYPRT');
Dcl-F QCUSTCDT Usage(*Update:*Delete:*Output) USROPN EXTDESC('QIWS/QCUSTCDT') RECNO(RRN);
Dcl-F QCUSTCDT Usage(*Update:*Delete:*Output) ;
Dcl-F rcdlckdspd WORKSTN;
dcl-f SRV_MSGTD workstn infds(dfInfDS) indds(dfIndDS) usropn;
Dcl-F BOOTH WORKSTN;
dcl-f MTNCUSTD workstn infds(dfInfDS) indds(dfIndDS) usropn;
dcl-f qsysprt printer(132) usropn;
Dcl-F B2 WORKSTN;
